#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/caprica/GitHub-Actions-Environments/runs/run-sDsEeaP7dvA1zpzr

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=faithful-tick]
aws_s3_bucket.bucket: Refreshing state... [id=288693765212-dev-bucket]
aws_s3_bucket_acl.example: Refreshing state... [id=288693765212-dev-bucket,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.bucket must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::288693765212-dev-bucket" -> (known after apply)
      ~ bucket                      = "288693765212-dev-bucket" # forces replacement -> (known after apply)
      ~ bucket_domain_name          = "288693765212-dev-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "288693765212-dev-bucket.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "288693765212-dev-bucket" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "Name"        = "My Dev bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "4ca834f3e92199e2c41a244c540b6c7718cfd0f30dbd71c8db0d0b2150311bb0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.example must be replaced
-/+ resource "aws_s3_bucket_acl" "example" {
      ~ bucket = "288693765212-dev-bucket" # forces replacement -> (known after apply)
      ~ id     = "288693765212-dev-bucket,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "capricaaws+dev" -> null
                  - id           = "4ca834f3e92199e2c41a244c540b6c7718cfd0f30dbd71c8db0d0b2150311bb0" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "capricaaws+dev" -> null
              - id           = "4ca834f3e92199e2c41a244c540b6c7718cfd0f30dbd71c8db0d0b2150311bb0" -> null
            }
        }
    }

  # random_pet.random_bucket_name will be created
  + resource "random_pet" "random_bucket_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "github-actions"
      + separator = "-"
    }

  # random_pet.sg will be destroyed
  # (because random_pet.sg is not in configuration)
  - resource "random_pet" "sg" {
      - id        = "faithful-tick" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.

```

</details>

*Pushed by: @caprica64, Action: `pull_request`*